maven-archtype-v2/maven-archetype-service-engine-v2/src/main/resources/archetype-resources/build/generated-sources/archetype/src/main/resources/archetype-resources/test/java/enginetest/test1Input.xml

#set( $symbol_pound = '#' )
#set( $symbol_dollar = '$' )
#set( $symbol_escape = '\' )
${symbol_pound}set( ${symbol_dollar}symbol_pound = '${symbol_pound}' )
${symbol_pound}set( ${symbol_dollar}symbol_dollar = '${symbol_dollar}' )
${symbol_pound}set( ${symbol_dollar}symbol_escape = '${symbol_escape}' )
<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope 
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:greet="http://www.sun.com/jbi/examples/sample-service/greetings/types/">       
   <soapenv:Header/>
   <soapenv:Body>
      <greet:user xmlns:greet="http://www.sun.com/jbi/examples/sample-service/greetings/types/">
         <greet:first-name>Srinivasan</greet:first-name>
         <greet:last-name>Chikkala</greet:last-name>
      </greet:user>
   </soapenv:Body>
</soapenv:Envelope>
